app/controllers/qualificacoes_controller.rb

  def new
    @qualificacao = Qualificacao.new

		if params[:cliente]
			@qualificacao.cliente = Cliente.find(params[:cliente])
		end

		if params[:restaurante]
			@qualificacao.restaurante = Restaurante.find(params[:restaurante])
---
SELECT * FROM `restaurantes` WHERE (`restaurantes`.`id` = 1)