app/controllers/restaurantes_controller.rb

SELECT * FROM `restaurantes` ORDER BY nome
SELECT count(*) AS count_all FROM `restaurantes`
---
	def index
		@restaurantes = Restaurante.paginate :page => params['page'], :per_page => 3

SELECT * FROM `restaurantes` WHERE (`restaurantes`.`id` = 1)
---
	def show
		@restaurante = Restaurante.find(params[:id])

INSERT INTO `restaurantes` (`endereco`, `created_at`, `nome`, `updated_at`, `especialidade`) VALUES('Rua do Sobrado, 34', '2010-08-17 21:41:41', 'Porcão', '2010-08-17 21:41:41', 'Churrasco')
---
	def create
		@restaurante = Restaurante.new(params[:restaurante])
		if @restaurante.save

SELECT * FROM `restaurantes` WHERE (`restaurantes`.`id` = 1)
---
	def edit
		@restaurante = Restaurante.find(params[:id])